newItems = [
  "<空>",
  "怪物糖果",
  "Croquet Roll",//TODO
  "木棍",
  "绷带",
  "石头糖",
  "南瓜环",
  "蜘蛛甜甜圈",
  "坚忍的洋葱",
  "幽灵果实",
  "蜘蛛果酒",
  "奶油糖肉桂派",
  "褪色缎带",
  "玩具刀",
  "牢固的手套",
  "兄贵头巾",
  "一份雪人",
  "好冰棒",
  "狗型冰棒",
  "情侣冰棒",
  "光棍冰棒",
  "肉桂兔包",
  "提米薄片",
  "遗弃的乳蛋饼",
  "旧芭蕾短裙",
  "芭蕾舞鞋",
  "打孔的卡片",
  "烦人的狗",
  "狗沙拉",
  "狗剩1",
  "狗剩2",
  "狗剩3",
  "狗剩4",
  "狗剩5",
  "狗剩6",
  "太空食物",
  "方便面",
  "蟹果",
  "热狗...?",
  "热猫",
  "魅力汉堡",
  "海茶",
  "新星巴菲",
  "传说英雄",
  "云雾眼镜",
  "破损的笔记本",
  "脏围裙",
  "烧焦的平底锅",
  "牛仔帽",
  "空枪",
  "心形吊坠",
  "生锈的匕首",
  "真刀",
  "吊坠",
  "不好的回忆",
  "梦想",
  "安黛因的信",
  "安黛因的信EX",
  "薯豆片",
  "垃圾食物",
  "神秘钥匙",
  "脸形牛排",
  "安静的狗",
  "蜗牛派",
  "提米盔甲",
  "<无效>"
];

newCellOpts = {
  "0":   "<空>",
  "201": "打招呼",
  "202": "谜题帮助",
  "203": "介绍自己",
  "204": "叫她\"妈妈\"",
  "205": "调情",
  "206": "托丽尔的电话",
  "210": "帕帕瑞斯的电话",
  "220": "维度盒子A",
  "221": "维度盒子B"
};

newWeaponAts = {
  "3": 0, // 木棍
  "13": 3,
  "16": 5,
  "52": 99,
  "47": 10,
  "25": 7,
  "45": 2,
  "49": 12,
  "51": 15
};

newArmorDfs = {
  "4": 0, // 绷带
  "12": 3, // 褪色缎带
  "15": 7, // 兄贵头巾
  "44": 5, // 云雾眼镜
  "46": 11, // 脏围裙
  "50": 15, // 心形吊坠
  "53": 99, // 吊坠
  "64": 20 // 提米护甲
};

newRooms = {
  "4":  "遗迹 - 初始点",
  "5":  "遗迹 - 小花地点",
  "6":  "遗迹 - 入口 [存档点]",
  "7":  "遗迹 - 托丽尔踩砖块谜题",
  "8":  "遗迹 - 开关谜题",
  "9":  "遗迹 - 假人房间",
  "10": "遗迹 - 尖刺谜题",
  "11": "遗迹 - 长廊",
  "12": "遗迹 - 树叶堆 [存档点]",
  "13": "遗迹 - 糖果柱子",
  "14": "遗迹 - 必定摔落陷阱门",
  "15": "遗迹 - 推石头谜题1",
  "16": "遗迹 - 陷阱门走廊谜题",
  "17": "遗迹 - 说话的石头",
  "18": "遗迹 - 老鼠洞 [存档点]",
  "19": "遗迹 - 幽灵纳普斯特",
  "20": "遗迹 - 蜘蛛烘焙铺",
  "21": "遗迹 - 2只青蛙",
  "22": "遗迹 - 开关下的陷阱门",
  "23": "遗迹 - 3个柱子房间1",
  "24": "遗迹 - 3个柱子房间2",
  "25": "遗迹 - 3个柱子房间3",
  "26": "遗迹 - 3个柱子房间4",
  "27": "遗迹 - 柱子房间下面的坑",
  "28": "遗迹 - 三岔路口",
  "29": "遗迹 - 讲托丽尔闲话的青蛙",
  "30": "遗迹 - 玩具刀房间",
  "31": "遗迹 - 家 [存档点]",
  "32": "托丽尔的家 - 入口",
  "33": "托丽尔的家 - 阅读房间",
  "34": "托丽尔的家 - 长廊",
  "35": "托丽尔的家 - 托丽尔的房间",
  "36": "托丽尔的家 - 你的房间",
  "37": "托丽尔的家 - 厨房",
  "38": "托丽尔的地下室1",
  "39": "托丽尔的地下室2",
  "40": "托丽尔的地下室3",
  "41": "托丽尔的地下室 - 托丽尔战斗",
  "42": "托丽尔的地下室 - 通往小花的长廊",
  "43": "托丽尔的地下室 - 小花",
  "44": "雪町 - 遗迹出口",
  "45": "雪町 - 黑森林小路",
  "46": "雪町 - Box Road [存档点]",//TODO
  "47": "雪町 - 鱼竿",
  "48": "雪町 - 帕帕瑞斯岗哨",
  "49": "雪町 - Doggo",//TODO
  "50": "雪町 - 指南针图标",
  "51": "雪町 - 雪人",
  "52": "雪町 - 高压电迷宫",
  "53": "雪町 - 雪地高尔夫",
  "54": "雪町 - 狗夫妇的房子",
  "55": "雪町 - 怪物小孩找单词",
  "56": "雪町 - 意大利面 [存档点]",
  "57": "雪町 - 狗夫妇",
  "58": "雪町 - XO谜题1",
  "59": "雪町 - XO谜题2",
  "60": "雪町 - 彩砖谜题",
  "61": "雪町 - 狗屋 [存档点]",
  "62": "雪町 - 雪人帕帕瑞斯和衫斯",
  "63": "雪町 - 滑动XO谜题",
  "64": "雪町 - 传送的衫斯",
  "65": "雪町 - 冰穴入口",
  "66": "雪町 - 雪堆(大犬汪)",
  "67": "雪町 - 致命的恐怖挑战",
  "68": "雪町 - 城镇 [存档点]",
  "69": "雪镇 - 扔冰的狼",
  "70": "雪镇 - 船坞",
  "71": "雪镇 - 宾馆大厅",
  "73": "雪镇 - 烤尔比",
  "74": "雪镇 - 图书馆",
  "81": "雪町 - 帕帕瑞斯战斗",
  "82":  "瀑布 - 入口",
  "83":  "瀑布 - 检查点 [存档点]",
  "84":  "瀑布 - 掉下的石头",
  "86":  "瀑布 - 长廊 [存档点]",
  "87":  "瀑布 - 连叶桥",
  "88":  "瀑布 - 莲叶竖桥",
  "90":  "瀑布 - 望远镜",
  "91":  "瀑布 - 船板",
  "92":  "瀑布 - 躲避安黛因的矛1",
  "93":  "瀑布 - 躲矛之后的草丛",
  "94":  "瀑布 - 水晶 [存档点]",
  "95":  "瀑布 - Sans望远镜",
  "96":  "瀑布 - 好冰棒摊贩",
  "97":  "瀑布 - 分裂路口",
  "98":  "瀑布 - 芭蕾舞鞋",
  "99":  "瀑布 - 鸭子",
  "100": "瀑布 - 洋葱桑",
  "101": "瀑布 - 艺术中心",
  "102": "瀑布 - 钢琴",
  "103": "瀑布 - 神器",
  "104": "瀑布 - 下雨的雕像",
  "105": "瀑布 - 伞",
  "106": "瀑布 - 下雨的小路1",
  "107": "瀑布 - 下雨的小路2",
  "108": "瀑布 - 宫殿风景",
  "109": "瀑布 - 伞架",
  "110": "瀑布 - 桥 [存档点]",
  "111": "瀑布 - 桥上躲矛",
  "112": "瀑布 - 从桥掉下",
  "113": "瀑布 - 垃圾区花床",
  "114": "瀑布 - 垃圾区 [存档点]",
  "115": "瀑布 - 训练假人的复仇",//为什么我输入"复"就会导致fcitx崩溃
  "116": "瀑布 - 安静区域 [存档点]",
  "117": "瀑布 - 安黛因房子的入口",
  "119": "瀑布 - 两间幽灵的房子",
  "124": "瀑布 - 乌龟商店",
  "125": "瀑布 - 船坞",
  "126": "瀑布 - 2个瀑布",
  "127": "瀑布 - 蘑菇谜题",
  "128": "瀑布 - 提米村庄 [存档点]",
  "129": "瀑布 - 灯谜题",
  "130": "瀑布 - 在你后面",
  "131": "瀑布 - 更多花",
  "132": "瀑布 - 洞穴桥梁",
  "133": "瀑布 - 洞穴出口",
  "134": "瀑布 - 安黛因区域1",
  "135": "瀑布 - 安黛因区域2",
  "136": "瀑布 - 热地欢迎提示",
  "137": "热地 - 入口",
  "138": "热地 - 饮水机",
  "139": "热地 - 实验室入口 [存档点]",
  "140": "热地 - 船坞",
  "141": "热地 - 实验室1楼",
  "142": "热地 - 实验室2楼",
  "143": "热地 - 实验室出口",
  "144": "热地 - 传送带1",
  "145": "热地 - 岩浆房间 [存档点]",
  "146": "热地 - 烧焦的平底锅",
  "147": "热地 - 激光1",
  "148": "热地 - 谜题门1",
  "149": "热地 - 左部谜题入口",
  "150": "热地 - 左部谜题",
  "151": "热地 - 右部谜题入口",
  "152": "热地 - 右部谜题",
  "153": "热地 - 箭头桥",
  "154": "热地 - 厨房",
  "155": "热地 - 核心景象 [存档点]",
  "156": "热地 - 电梯 R1",
  "157": "热地 - 电梯 R2",
  "158": "热地 - 热狗摊贩",
  "159": "热地 - 艺术中心入口",
  "160": "热地 - 艺术中心",
  "161": "热地 - 脏围裙",
  "162": "热地 - 传送带开关谜题",
  "163": "热地 - 剑谜题",
  "164": "热地 - 坏选择区域 [存档点]",
  "165": "热地 - 皇家守卫",
  "166": "热地 - 炸弹新闻报道",
  "167": "热地 - 上层核心景象",
  "168": "热地 - 电梯 L2",
  "169": "热地 - 电梯 L3",
  "170": "热地 - 蜘蛛烘焙铺",
  "171": "热地 - 谜题门2",
  "172": "热地 - 南部谜题入口",
  "173": "热地 - 南部谜题",
  "174": "热地 - 北部谜题",
  "175": "热地 - 北部谜题入口",
  "176": "热地 - 蜘蛛入口 [存档点]",
  "177": "热地 - 蜘蛛房间",
  "178": "热地 - 镁塔顿海报",
  "179": "热地 - 剧台",
  "180": "热地 - 彩砖谜题2",
  "181": "热地 - 好冰棒摊贩",
  "182": "热地 - 旅馆入口",
  "183": "热地 - 旅馆大厅 [存档点]",
  "184": "热地 - 旅馆餐厅",
  "185": "热地 - 旅馆长廊",
  "186": "热地 - 旅馆房间",
  "187": "热地 - 电梯 R3",
  "188": "核心 - 入口",
  "189": "核心 - 电梯",
  "190": "核心 - 陷阱",
  "192": "核心 - 错误顺序激光",
  "191": "核心 - 电梯北部",
  "193": "核心 - 十字路口",
  "194": "核心 - 死路(晚安骑士)",
  "195": "核心 - 激光电源谜题",
  "196": "核心 - 核心分支 [存档点]",
  "197": "核心 - 堆积的冰块",
  "198": "核心 - 西部谜题入口1",
  "199": "核心 - 西部谜题入口2",
  "200": "核心 - 西部谜题入口3",
  "202": "核心 - 末尾3",
  "201": "核心 - 南部100G垃圾桶",
  "203": "核心 - 末尾4",
  "204": "核心 - 迷路",
  "205": "核心 - 西部谜题",
  "206": "核心 - 魅力汉堡垃圾桶",
  "207": "核心 - 100G垃圾桶",
  "208": "核心 - 战斗桥",
  "209": "核心 - 末尾1",
  "210": "核心 - 核心末尾 [存档点]",
  "211": "核心 - 镁塔顿房间",
  "212": "核心 - 最后一个电梯入口",
  "214": "热地 - 电梯 L1",
  "215": "核心 - 最后一个电梯",
  "216": "城堡电梯 [存档点]",
  "217": "城堡 - 另一个电梯",
  "218": "城堡 - 暗黑小路",
  "219": "新家 [存档点]",
  "220": "新家 - 入口",
  "221": "新家 - 读书室",
  "222": "新家 - 走廊",
  "223": "新家 - Asgore的房间",
  "224": "新家 - 你的房间",
  "225": "新家 - 厨房",
  "226": "新家 - 地下室1",
  "227": "新家 - 地下室2",
  "228": "新家 - 地下室3",
  "229": "新家 - 地下室4",
  "230": "新家 - 电梯",
  "231": "审判长廊 [存档点]",
  "232": "王座入口 [存档点]",
  "233": "王座入口 - 向下楼梯",
  "234": "王座入口 - 棺材",
  "235": "王座 [存档点]",
  "236": "结束 [存档点]",
  "237": "屏障",
  "241": "外面[未使用]",
  "242": "实验室电梯",
  "243": "真实验室 - 电梯",
  "244": "真实验室 - 电梯入口",
  "245": "真实验室 - 南部长廊",
  "246": "真实验室 [存档点]",
  "247": "真实验室 - 西部长廊1",
  "248": "真实验室 - 西部水槽",
  "249": "真实验室 - 西部红色钥匙孔",
  "250": "真实验室 - 北部长廊1",
  "251": "真实验室 - 卧室 [存档点]",
  "252": "真实验室 - 东北长廊",
  "253": "真实验室 - 东北蓝色钥匙孔",
  "254": "真实验室 - 北部长廊2",
  "255": "真实验室 - 绿色钥匙",
  "256": "真实验室 - 西北头颅",
  "257": "真实验室 - 黄色钥匙孔+电视",
  "258": "真实验室 - 西北冰箱",
  "259": "真实验室 - 绿钥匙孔",
  "260": "真实验室 - 风扇",
  "261": "真实验室 - 电梯2",
  "262": "真实验室 - 供电房长廊",
  "263": "真实验室 - 供电房",
  "264": "W. D. Gaster",
  "265": "雪町 - 冰穴",
  "331": "艾斯利尔的房间[未使用]"
};

newFloweyStates = {
  "0": "无 (初始状态)",
  "1": "浅蓝 (战斗开始)",
  "2": "橙",
  "3": "蓝",
  "4": "紫",
  "5": "绿",
  "6": "黄",
  "7": "无 (战斗完成)",
};

newTorielPrefer={
  "0": "未知",
  "1": "奶油糖",
  "2": "肉桂"
};

newTorielStates = {
  "0": "初始状态",
  "3": "未知",
  "4": "被杀死",
  "5": "被饶恕"
};

newComedianStates = {
  "0": "初始状态",
  "1": "未知",
  "2": "被杀死"
};

newDoggoStates = {
  "0": "初始状态",
  "1": "被杀死",
  "2": "被饶恕"
};

newDogamyDogaressaStates = {
  "0": "初始状态",
  "1": "被杀死",
  "2": "被饶恕"
};

newGreaterDogStates = {
  "0": "初始状态",
  "1": "被杀死",
  "2": "被饶恕",
  "3": "被忽略"
};

newPapyrusStates = {
  "0": "初始状态",
  "1": "被杀死"
};

newPlotValues = {
  "2": "没有与帕帕瑞斯战斗",
  "101": "已与帕帕瑞斯战斗",
  "119": "未知",
  "164": "热地屠杀",
  "199": "未知",
  "999": "真和平结局"
};

newTrainingDummyStates = {
  "0": "初始状态",
  "1": "被杀死",
  "2": "被谈话",
  "3": "试了你的意大利面"
};

newShyrenStates = {
  "0": "初始状态",
  "1": "被杀死",
  "2": "未知"
};

newMadDummyStates = {
  "0": "初始状态",
  "1": "被杀死"
};

newUndyneStates1 = {
  "0": "初始状态",
  "1": "被杀死"
};

newUndyneStates2 = {
  "0": "初始状态",
  "1": "被杀死"
};

newBroGuardsStates = {
  "0": "初始状态",
  "1": "被杀死"
};

newMettatonStates = {
  "0": "初始状态",
  "1": "被杀死"
};

newMuffetStates = {
  "0": "初始状态",
  "1": "被杀死"
};

newIniErrors = {
  outOfSection:"小节以外的配置项",
  exceptEqual:"期望 '='",
  exceptSlash:"期望 '\"'",
  unclosedString:"未结束的字符串"
}

newAlertText = {
  errorParseIni:"解析undertale.ini失败: ",
  selectFile:"请选择一个文件!",
  enterName:"输入配置名称",
  invaindName:"无效名称，未创建配置!",
  selectConfig:"请选择一个有效的配置！"
}
